[TOC]

# 第五章 Pandas入门

**NumPy**中的基本数据结构是**ndarray**，而**Pandas**基于ndarray构建**Index**, **Series**和**DataFrame**。<br/>
当然**Pandas**也包含许多的**ufunc**。<br/>
**Pandas**更便于处理**表格数据**及**数据加载、存储和清洗**。<br/>
与dict显示相同，**Index**, **Series**和**DataFrame**也按输入索引顺序显示<br/>

In [7]:
import pandas as pd
from pandas import Series, DataFrame, Index
import numpy as np

## 5.1 pandas基本数据结构

In [3]:
type(obj.index)

pandas.core.indexes.base.Index

### Series

**Series**表示**一列数据**，由索引(**Index**)和一列值(**value**)构成<br/>
pd.Series = series.index + series.value<br/>
**index取值**<br/>
**value运算**

In [13]:
obj = pd.Series([4, 7, -5, 3])  # list construct Series
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [14]:
type(obj)

pandas.core.series.Series

In [15]:
obj.index  # like range(0, 4)

RangeIndex(start=0, stop=4, step=1)

In [16]:
type(obj.index)

pandas.core.indexes.range.RangeIndex

In [17]:
obj.values

array([ 4,  7, -5,  3])

In [18]:
type(obj.values)

numpy.ndarray

In [94]:
obj.T  # still itself

0    4
1    7
2   -5
3    3
dtype: int64

In [95]:
type(obj.T)

pandas.core.series.Series

In [12]:
obj2 = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])  # stringsobj2[obj2 > 0] as indices
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [19]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [20]:
type(obj2.index)

pandas.core.indexes.base.Index

In [21]:
obj2['a']

4

In [22]:
obj2['d'] = 6
obj2

a    4
b    7
c   -5
d    6
dtype: int64

In [23]:
obj2[['c', 'b', 'a']]

c   -5
b    7
a    4
dtype: int64

In [24]:
obj2[obj2 > 0]

a    4
b    7
d    6
dtype: int64

In [25]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [27]:
import numpy as np
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d     403.428793
dtype: float64

In [28]:
'b' in obj2

True

In [29]:
'e' in obj2

False

In [32]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}  # dict construct Series
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [40]:
obj4 = pd.Series(list(sdata.values()), sdata.keys())  # dict equal two corresponding list/sequence
obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj4.index.name = 'area_name'
obj4

area_name
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [44]:
obj4.name = 'area'
obj4

area_name
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: area, dtype: int64

In [45]:
# test NA
obj4['California'] = np.NAN
obj4

area_name
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
Utah           5000.0
California        NaN
Name: area, dtype: float64

In [46]:
np.isnan(obj4)

area_name
Ohio          False
Texas         False
Oregon        False
Utah          False
California     True
Name: area, dtype: bool

In [47]:
pd.isnull(obj4)

area_name
Ohio          False
Texas         False
Oregon        False
Utah          False
California     True
Name: area, dtype: bool

In [50]:
~obj4.notnull()

area_name
Ohio          False
Texas         False
Oregon        False
Utah          False
California     True
Name: area, dtype: bool

### DataFrame

**DataFrame**表示**表格数据**，由多列数据(**Series**)组成，共用一个**行索引**(Index)和一个**列索引**(Columns)。

In [72]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}  # dict of lists
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [62]:
type(frame)

pandas.core.frame.DataFrame

In [58]:
frame.index

RangeIndex(start=0, stop=6, step=1)

In [59]:
type(frame.index),

(pandas.core.indexes.range.RangeIndex,)

In [60]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [61]:
type(frame.columns)

pandas.core.indexes.base.Index

In [63]:
frame.head() # first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [64]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])  # assign columns

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [65]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])  # assign columns, index
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [67]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [68]:
type(frame2.index)

pandas.core.indexes.base.Index

In [70]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [75]:
frame2.state  # column name is valid for Python variable name 
# 并且注意不要与DataFrame内置对象冲突

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [76]:
frame2.loc['three']  # label indexing including integer

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [78]:
frame2.iloc[2]  # integr indexing

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [79]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [86]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])  # value match by index
frame2['debt'] = val
frame2

       year   state  pop  debt  debt2
one    2000    Ohio  1.5   NaN    NaN
two    2001    Ohio  1.7  -1.2   -1.2
three  2002    Ohio  3.6   NaN    NaN
four   2001  Nevada  2.4  -1.5   -1.5
five   2002  Nevada  2.9  -1.7   -1.7
six    2003  Nevada  3.2   NaN    NaN

In [89]:
frame2['eastern'] = frame2.state == 'Ohio'  # create ‘eastern’ column  
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [90]:
del frame2['eastern']  # delete ‘eastern’ column
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [91]:
frame2.columns  # view

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [92]:
frame2.columns.copy()  # copy

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [10]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}  # dict of dicts
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [96]:
frame3.T  # transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [11]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [99]:
frame3.values  # 2d ndarray

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [103]:
type(frame3.values), frame3.values.shape

(numpy.ndarray, (3, 2))

In [104]:
frame2.values  # dtype accommodate all dtypes of the columns

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

![Possible data inputs to DataFrame constructor](res/imgs/chp5_getting_started_with_pandas/df_constructor.png)

使用输入数据构造**DataFrame**的方式有许多种，但整体总结就**list**和**dict**。
- list of：按**行**构造
- dict of：按**列**构造

### Index Objects

metadata(元数据)，data of data<br/>
- Series中的index, index.name<br/>
- DataFrame中的index, columns, index.name, columns.name<br/>

index/columns是values的元数据<br/>
而name是index/columns的元数据

In [5]:
int_index = pd.Index(np.arange(3))
int_index

Int64Index([0, 1, 2], dtype='int64')

In [19]:
int_index[1] = 'd'  # TypeError: Index does not support mutable operations

TypeError: Index does not support mutable operations

In [20]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

**Index**像**dict**中的**keys**，**有序**，**不能更改**，但可以**重复**<br/>

Index
- series.index
- frame.index, frame.columns

In [7]:
obj = pd.Series([1.5, -2.5, 0], index=int_index)  # Index of Series
obj.index

Int64Index([0, 1, 2], dtype='int64')

In [8]:
obj.index is int_index

True

In [9]:
1 in obj.index

True

In [12]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [16]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [17]:
2003 in frame3.index

False

In [18]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [21]:
'Ohio' in frame3.columns

True

In [23]:
set(('b', 'a', 'c'))

{'a', 'b', 'c'}

**Index**像**dict**中的**keys**，**有序**，**不能更改**，但可以**重复**<br/>
- 集合运算: union, intersection, difference
- 序列运算: append, delete, drop, insert

![Some Index methods and properties](res/imgs/chp5_getting_started_with_pandas/Index_methods_properties.png)

## 5.2 基本功能

### 重置索引

copy<br/>
实际上产生一个新索引**替换**原索引<br/>
因此产生一个新的对象(Index, Series, DataFrame)

In [42]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj.reindex(index=['a', 'b', 'c', 'd', 'e'])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [7]:
# NAN填充方式
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6), method='ffill')  # forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
obj3.reindex(range(6), method='bfill')  # backward fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [10]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [11]:
frame.reindex(['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [12]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [25]:
frame.loc[['a', 'b', 'c', 'd'], states]  # .loc or [] equivalence
frame[['Texas', 'California']]

   Texas  California
a      1           2
c      4           5
d      7           8

In [47]:
frame[['Texas', 'California']][:2]

   Texas  California
a      1           2
c      4           5

**编程好习惯**：<br/>
use **df.reindex()** to alternate .loc or []

![reindex function arguments](res/imgs/chp5_getting_started_with_pandas/reindex_func_args.png)

### 按轴删除条目

df.drop(self, labels=None, axis=0, index=None, columns=None,
             level=None, inplace=False, errors='raise')<br/>
axis=0 or 'index'| index=labels，从**index**删除lables<br/>
axis=1 or 'columns'| columns=labels，从**columns**删除lables<br/>

In [43]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [27]:
obj.drop('c')

d    4.5
b    7.2
a   -5.3
dtype: float64

In [28]:
obj.drop(['a', 'c'])

d    4.5
b    7.2
dtype: float64

In [37]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.drop(['Ohio', 'Colorado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [34]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [38]:
data.drop(['Ohio'], inplace=True)  # inplace drop

In [39]:
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.drop(['Shanghai'], inplace=True)   # drop labels must exist in index or colomns

KeyError: "['Shanghai'] not found in axis"

### 索引，选择和过滤

同ndarray一样——使用位置索引和布尔索引<br/>
df还可以使用标签索引<br/>
- 位置索引[ )，右侧不包含
- 标签索引[ ]，右侧包含

In [48]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [49]:
obj['b']

1.0

In [50]:
obj[1]

1.0

In [51]:
obj[2:4]  # exclude 4

c    2.0
d    3.0
dtype: float64

In [52]:
obj['c':'d']  # include 'd'

c    2.0
d    3.0
dtype: float64

In [53]:
obj[[1, 2, 3]]

b    1.0
c    2.0
d    3.0
dtype: float64

In [54]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [55]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [56]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

df由多个series组成<br/>
在**df检索**相当于在**多行/多列series检索**
- [] | .ix, 标签列索引，数字行索引，我理解这么设置的原因是在关系型数据库中：一张表中，一般行索引设置为数字，列索引设置为标签
- .loc, 标签索引
- .iloc,位置索引

In [57]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data['two']  # columns indexing

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [59]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [60]:
data[:2]  # index/rows indexing

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [61]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [64]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**.loc** for label based indexing(**labels**)<br/>
**.iloc** for positional indexing(**integers**)<br/>

In [65]:
# Selection with loc and iloc
data.loc['Colorado', ['two', 'three']]  # one row, two columns

two      5
three    6
Name: Colorado, dtype: int64

In [67]:
data.iloc[1, [1, 2]]  # loc, iloc are equivalent

two      5
three    6
Name: Colorado, dtype: int64

In [68]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [69]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [70]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [71]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

![Indexing options with DataFrame](res/imgs/chp5_getting_started_with_pandas/Indexing_with_df.png)

编程好习惯：<br/>
use **.loc** or **.iloc** to alternate .ix<br/>

### 整数索引

In [75]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [78]:
ser[-1]  # KeyError: -1

KeyError: -1

数字也是标签，因此这种索引存在歧义，指定特种含义可能会引入微妙的BUG<br/>
因此推荐使用iloc, loc

In [79]:
ser.iloc[-1]

2.0

In [80]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [81]:
ser.iloc[:2]

0    0.0
1    1.0
dtype: float64

### 算术和数据对齐

算术和数据对齐类似于**Numpy**中的**广播**(broadcasting)机制<br/>
只不过**df**是**二维**的，基于**index**， **columns**对齐<br/>
**缺乏的值填充NaN**

In [83]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [84]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [85]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [89]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
# not overlap, return all NaN
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [4]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('dcb'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            d    c    b
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [5]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [6]:
df1 + df2  # index/columns resorted

             b   c     d   e
Colorado   NaN NaN   NaN NaN
Ohio       5.0 NaN   4.0 NaN
Oregon     NaN NaN   NaN NaN
Texas     11.0 NaN  10.0 NaN
Utah       NaN NaN   NaN NaN

In [7]:
# fill NaN or inf
df1.add(df2, fill_value=0)  # not overlap, return NaN; one index/columns overlap, return 0

             b    c     d     e
Colorado   8.0  7.0   6.0   NaN
Ohio       5.0  1.0   4.0   5.0
Oregon     9.0  NaN  10.0  11.0
Texas     11.0  4.0  10.0   8.0
Utah       0.0  NaN   1.0   2.0

![Flexible arithmetic methods](res/imgs/chp5_getting_started_with_pandas/arith_methods.png)

In [ ]:
在DataFrame和Series之间的运算

In [3]:
# Operations between DataFrame and Series
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [8]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [9]:
frame - series  # rows broadcasting

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [4]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [5]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [6]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [7]:
frame - series3  # series.index default match df.columns, not expectation

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [11]:
frame.sub(series3, axis='index')  # series.index match df.index

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用与映射

**NumPy ufuncs**能作用于Pandas对象——df、series、index。

<br/>

**df.apply( )**作用于**series**<br/>
而**df.applymap( )**作用于**df**<br/>

**df.apply**(self, **func**, **axis=0**, broadcast=None, raw=False, reduce=None,
              result_type=None, args=(), kwds)
- axis=0 or 'index' func沿rows作用于df
- axis=1 or 'columns' func沿columns作用于df

<br/>

**df.applymap**(self, **func**)
- func直接作用于整个df

In [12]:
# set random seed
np.random.seed(220184597)  # for reproducibility
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.871380 -0.282640 -1.846588
Ohio   -0.357567  1.595056  1.189890
Texas  -0.373951  0.418893  0.252114
Oregon  1.095310  0.020946  0.839947

In [13]:
np.abs(frame)

               b         d         e
Utah    0.871380  0.282640  1.846588
Ohio    0.357567  1.595056  1.189890
Texas   0.373951  0.418893  0.252114
Oregon  1.095310  0.020946  0.839947

In [14]:
f = lambda x: x.max() - x.min()
frame.apply(f)  # default down index

b    1.469261
d    1.877696
e    3.036478
dtype: float64

In [15]:
frame.apply(f, axis='columns')  # down columns

Utah      2.717969
Ohio      1.952623
Texas     0.792844
Oregon    1.074363
dtype: float64

In [16]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.87  -0.28  -1.85
Ohio    -0.36   1.60   1.19
Texas   -0.37   0.42   0.25
Oregon   1.10   0.02   0.84

In [18]:
frame['d'].map(format)  # series.map()

Utah      -0.28
Ohio       1.60
Texas      0.42
Oregon     0.02
Name: d, dtype: object

### 排序和排名

两个df进行运算时，会自动返回重新排序索引的结果(copy)<br/>

**排序**(sort)和**排名**(rank)
- 索引排序
- 值排序
- 值排名: 排名从1开始计数

In [20]:
# sort
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [21]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [22]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [23]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [24]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [25]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [26]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [27]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [28]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [29]:
obj.sort_values()  # NAN default 'last'

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [30]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [32]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [33]:
frame.sort_values(by=['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [34]:
# rank
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [35]:
obj.rank()  # default method='average' 0:7, 1:7 => 0:6.5, 1:6.5

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [36]:
obj.rank(method='first')  # method='first 0:7, 1:7 => 0:6, 1:7

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [37]:
obj.rank(ascending=False, method='max')  # descending, method='max' 0:7, 1:7 => 0:2, 1:2

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [38]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [40]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

![Tie-breaking methods with rank](res/imgs/chp5_getting_started_with_pandas/rank_group_methods.png)

### 重复标签的轴索引

引用**重复**索引，获取多个值(series)<br/>
引用**独特**索引，获取一个值(value)

In [42]:
pd.Series(range(5), index=[0, 0, 1, 1, 2])

0    0
0    1
1    2
1    3
2    4
dtype: int64

In [43]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [45]:
obj.index.is_unique

False

In [48]:
obj['a']

a    0
a    1
dtype: int64

In [49]:
type(obj['a'])

pandas.core.series.Series

In [47]:
obj['c']

4

In [50]:
type(obj['c'])

numpy.int64

In [52]:
# set random seed
np.random.seed(220184597)  # for reproducibility
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.871380 -0.282640 -1.846588
a -0.357567  1.595056  1.189890
b -0.373951  0.418893  0.252114
b  1.095310  0.020946  0.839947

In [53]:
df.loc['b']

          0         1         2
b -0.373951  0.418893  0.252114
b  1.095310  0.020946  0.839947

## 5.3 统计

### 协方差及相关系数

**协方差**(Covariance)<br/>
$\operatorname{Cov}(X, Y)=E\left[\left(X-\mu_{x}\right)\left(Y-\mu_{y}\right)\right]$
- 衡量两个变量变化的趋同程度
- 数值越大，变化越趋同
- \>0，正向变化
- <0，反向变化

<br/>

**相关系数**(Correlation)<br/>
$\operatorname{Corr}=\frac{\operatorname{Cov}(X, Y)}{\sigma_{X} \sigma_{Y}}，\sigma \text{为标准差}$
- 标准化协方差
- 取值范围为[-1, 1]
- -1完全负相关，1完全正相关

<br/>

协方差和相关系数只代表**线性相关性**; **不代表随机变量的相互独立性**

<br/>

更多知识详见<a href="https://www.zhihu.com/question/20852004">如何通俗易懂地解释「协方差」与「相关系数」的概念？</a>

In [1]:
# download stock tickers 
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [5]:
# all_data

In [4]:
all_data['AAPL'].head()

                 High        Low       Open      Close       Volume  Adj Close
Date
2009-12-31  30.478571  30.080000  30.447144  30.104286   88102700.0  26.272409
2010-01-04  30.642857  30.340000  30.490000  30.572857  123432400.0  26.681330
2010-01-05  30.798571  30.464285  30.657143  30.625713  150476200.0  26.727465
2010-01-06  30.747143  30.107143  30.625713  30.138571  138040000.0  26.302330
2010-01-07  30.285715  29.864286  30.250000  30.082857  119282800.0  26.253704

In [8]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})  # Adj Close price
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})  # Volume

In [9]:
price.head()

                 AAPL        IBM       MSFT        GOOG
Date
2009-12-31  26.272409  96.994438  24.072418  308.832428
2010-01-04  26.681330  98.142967  24.443624  312.204773
2010-01-05  26.727465  96.957375  24.451517  310.829926
2010-01-06  26.302330  96.327530  24.301458  302.994293
2010-01-07  26.253704  95.994110  24.048725  295.940735

In [19]:
price.tail()

                  AAPL         IBM        MSFT         GOOG
Date
2019-08-19  210.350006  135.039993  138.410004  1198.449951
2019-08-20  210.360001  133.000000  137.259995  1182.689941
2019-08-21  212.639999  134.250000  138.789993  1191.250000
2019-08-22  212.460007  134.320007  137.779999  1189.530029
2019-08-23  202.639999  129.570007  133.389999  1151.290039

In [14]:
returns = price.pct_change()

In [20]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-08-19  0.018644  0.009569  0.016749  0.017705
2019-08-20  0.000048 -0.015107 -0.008309 -0.013150
2019-08-21  0.010839  0.009398  0.011147  0.007238
2019-08-22 -0.000846  0.000521 -0.007277 -0.001444
2019-08-23 -0.046220 -0.035363 -0.031862 -0.032147

In [32]:
# covariance
returns['IBM'].cov(returns['AAPL'])

7.812149924844819e-05

In [33]:
returns.IBM.cov(returns.AAPL)

7.812149924844819e-05

In [29]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000267  0.000078  0.000108  0.000118
IBM   0.000078  0.000153  0.000088  0.000078
MSFT  0.000108  0.000088  0.000209  0.000121
GOOG  0.000118  0.000078  0.000121  0.000242

In [24]:
# correlation
returns['MSFT'].corr(returns['IBM'])

0.49202650879988713

In [26]:
returns.MSFT.corr(returns.IBM)

0.49202650879988713

In [27]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.385994  0.457442  0.462546
IBM   0.385994  1.000000  0.492027  0.406264
MSFT  0.457442  0.492027  1.000000  0.538272
GOOG  0.462546  0.406264  0.538272  1.000000

In [34]:
returns.corrwith(returns['AAPL'])

AAPL    1.000000
IBM     0.385994
MSFT    0.457442
GOOG    0.462546
dtype: float64

### 独特值，统计值和成员值

In [35]:
# unique
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [36]:
# count values
obj.value_counts()  # descending by counts

c    3
a    3
b    2
d    1
dtype: int64

In [38]:
pd.value_counts(obj.values, sort=True, ascending=False)

c    3
a    3
b    2
d    1
dtype: int64

In [39]:
# membership
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [40]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [42]:
uniqe_values = pd.Series(['b', 'c'])
index = pd.Index(uniqe_values).get_indexer(obj)  # -1 not exist
mask = index >= 0
mask

array([ True, False, False, False, False,  True,  True,  True,  True])

In [43]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [44]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],              
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [45]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 5.4 总结

本章了解和掌握Pandas的基本数据结构和功能。<br/>
在下一章（第六章）中，我们将讨论使用Pandas读取（或加载）和写入数据。<br/>
之后，我们将使用pandas深入数据清洗，处理，分析以及matplotlib可视化。